import { createStore } from "vuex";

const store = createStore({
  state: {
    newsItems: [
      {
        id: 1,
        image: require("@/assets/Main Picture.png"),
        releaseDate: "12.08.2023",
        category: "პოლიტიკა",
        title:
          "ქვემო ქართლის რეგიონში 20 მლნ ლარამდე ღირებულების ინფრასტრუქტურული პროექტები დაიწყებ",
        description:
          "ანთავსების (ლისტინგის) ორგანიზატორი სომხეთის ბანკი სს “არდშიბანკია”. ობლიგაციის ნომინალი - 1000 USD",
      },

      {
        id: 2,
        image: require("@/assets/Main Picture.png"),
        releaseDate: "12.08.2023",
        category: "პოლიტიკა",
        title:
          "ქვემო ქართლის რეგიონში 20 მლნ ლარამდე ღირებულების ინფრასტრუქტურული პროექტები დაიწყება",
        description:
          "ანთავსების (ლისტინგის) ორგანიზატორი სომხეთის ბანკი სს “არდშიბანკია”. ობლიგაციის ნომინალი - 1000 USD",
      },
      {
        id: 3,
        image: require("@/assets/Main Picture.png"),
        releaseDate: "12.08.2023",
        category: "პოლიტიკა",
        title:
          "ქვემო ქართლის რეგიონში 20 მლნ ლარამდე ღირებულების ინფრასტრუქტურული პროექტები დაიწყება",
        description:
          "ანთავსების (ლისტინგის) ორგანიზატორი სომხეთის ბანკი სს “არდშიბანკია”. ობლიგაციის ნომინალი - 1000 USD",
      },
      {
        id: 4,
        image: require("@/assets/Main Picture.png"),
        releaseDate: "12.08.2023",
        category: "პოლიტიკა",
        title:
          "ქვემო ქართლის რეგიონში 20 მლნ ლარამდე ღირებულების ინფრასტრუქტურული პროექტები დაიწყება",
        description:
          "ანთავსების (ლისტინგის) ორგანიზატორი სომხეთის ბანკი სს “არდშიბანკია”. ობლიგაციის ნომინალი - 1000 USD",
      },
      {
        id: 5,
        image: require("@/assets/Main Picture.png"),
        releaseDate: "12.08.2023",
        category: "პოლიტიკა",
        title:
          "ქვემო ქართლის რეგიონში 20 მლნ ლარამდე ღირებულების ინფრასტრუქტურული პროექტები დაიწყებ",
        description:
          "ანთავსების (ლისტინგის) ორგანიზატორი სომხეთის ბანკი სს “არდშიბანკია”. ობლიგაციის ნომინალი - 1000 USD",
      },
      {
        id: 6,
        image: require("@/assets/Main Picture.png"),
        releaseDate: "12.08.2023",
        category: "პოლიტიკა",
        title:
          "ქვემო ქართლის რეგიონში 20 მლნ ლარამდე ღირებულების ინფრასტრუქტურული პროექტები დაიწყებ",
        description:
          "ანთავსების (ლისტინგის) ორგანიზატორი სომხეთის ბანკი სს “არდშიბანკია”. ობლიგაციის ნომინალი - 1000 USD",
      },
    ],
    allNews: [
      {
        id: 1,
        releaseHour: "7:30",
        releaseDate: "12.08.2023",
        description:
          "დღეიდან ასაწონად განკუთვნილი პოლიეთილენის პარკები აიკრძალა",
      },
      {
        id: 2,
        releaseHour: "7:30",
        releaseDate: "12.08.2023",
        description:
          "დღეიდან ასაწონად განკუთვნილი პოლიეთილენის პარკები აიკრძალა",
      },
      {
        id: 3,
        releaseHour: "7:30",
        releaseDate: "12.08.2023",
        description:
          "დღეიდან ასაწონად განკუთვნილი პოლიეთილენის პარკები აიკრძალა",
      },
      {
        id: 4,
        releaseHour: "7:30",
        releaseDate: "12.08.2023",
        description:
          "დღეიდან ასაწონად განკუთვნილი პოლიეთილენის პარკები აიკრძალა",
      },
      {
        id: 5,
        releaseHour: "7:30",
        releaseDate: "12.08.2023",
        description:
          "დღეიდან ასაწონად განკუთვნილი პოლიეთილენის პარკები აიკრძალა",
      },
      {
        id: 6,
        releaseHour: "7:30",
        releaseDate: "12.08.2023",
        description:
          "დღეიდან ასაწონად განკუთვნილი პოლიეთილენის პარკები აიკრძალა",
      },
      {
        id: 7,
        releaseHour: "7:30",
        releaseDate: "12.08.2023",
        description:
          "დღეიდან ასაწონად განკუთვნილი პოლიეთილენის პარკები აიკრძალა",
      },
      {
        id: 8,
        releaseHour: "7:30",
        releaseDate: "12.08.2023",
        description:
          "დღეიდან ასაწონად განკუთვნილი პოლიეთილენის პარკები აიკრძალა",
      },
      {
        id: 9,
        releaseHour: "7:30",
        releaseDate: "12.08.2023",
        description:
          "დღეიდან ასაწონად განკუთვნილი პოლიეთილენის პარკები აიკრძალა",
      },
      {
        id: 10,
        releaseHour: "7:30",
        releaseDate: "12.08.2023",
        description:
          "დღეიდან ასაწონად განკუთვნილი პოლიეთილენის პარკები აიკრძალა",
      },
      {
        id: 1,
        releaseHour: "7:30",
        releaseDate: "12.08.2023",
        description:
          "დღეიდან ასაწონად განკუთვნილი პოლიეთილენის პარკები აიკრძალა",
      },
      {
        id: 2,
        releaseHour: "7:30",
        releaseDate: "12.08.2023",
        description:
          "დღეიდან ასაწონად განკუთვნილი პოლიეთილენის პარკები აიკრძალა",
      },
      {
        id: 3,
        releaseHour: "7:30",
        releaseDate: "12.08.2023",
        description:
          "დღეიდან ასაწონად განკუთვნილი პოლიეთილენის პარკები აიკრძალა",
      },
      {
        id: 4,
        releaseHour: "7:30",
        releaseDate: "12.08.2023",
        description:
          "დღეიდან ასაწონად განკუთვნილი პოლიეთილენის პარკები აიკრძალა",
      },
      {
        id: 5,
        releaseHour: "7:30",
        releaseDate: "12.08.2023",
        description:
          "დღეიდან ასაწონად განკუთვნილი პოლიეთილენის პარკები აიკრძალა",
      },
      {
        id: 6,
        releaseHour: "7:30",
        releaseDate: "12.08.2023",
        description:
          "დღეიდან ასაწონად განკუთვნილი პოლიეთილენის პარკები აიკრძალა",
      },
      {
        id: 7,
        releaseHour: "7:30",
        releaseDate: "12.08.2023",
        description:
          "დღეიდან ასაწონად განკუთვნილი პოლიეთილენის პარკები აიკრძალა",
      },
      {
        id: 8,
        releaseHour: "7:30",
        releaseDate: "12.08.2023",
        description:
          "დღეიდან ასაწონად განკუთვნილი პოლიეთილენის პარკები აიკრძალა",
      },
      {
        id: 9,
        releaseHour: "7:30",
        releaseDate: "12.08.2023",
        description:
          "დღეიდან ასაწონად განკუთვნილი პოლიეთილენის პარკები აიკრძალა",
      },
      {
        id: 10,
        releaseHour: "7:30",
        releaseDate: "12.08.2023",
        description:
          "დღეიდან ასაწონად განკუთვნილი პოლიეთილენის პარკები აიკრძალა",
      },
    ],
  },
  getters: {
    getNewsItems: (state) => state.newsItems,
    getAllNews: (state) => state.allNews,
  },
});

export default store;
